# **06. 데이터프레임 병합**

## **목차**

1. `merge`명령을 사용한 데이터프레임 병합   

2. `join` 메서드  
        연습문제 6-1
        
3. `concat`명령을 사용한 데이터 연결 
        연습문제 6-2

Pandas는 두 개 이상의 데이터프레임을 하나로 합치는 데이터 **병합(merge)**이나 **연결(concatenate)**을 지원한다.

## 1. `merge` 명령을 사용한 데이터프레임 병합

`merge` 명령은 두 데이터 프레임의 공통 열 혹은 인덱스를 기준으로 두 개의 테이블을 합친다. 이 때 **기준이 되는 열, 행의 데이터를 *키(key)***라고 한다.

In [3]:
import numpy as np
import pandas as pd

df1 = pd.DataFrame({
    '고객번호' : [1001, 1002, 1003, 1004, 1005, 1006, 1007],
    '이름' : ['둘리', '도우너', '또치', '길동', '희동', '마이콜', '영희']
    }, columns=['고객번호', '이름'])
df1

   고객번호   이름
0  1001   둘리
1  1002  도우너
2  1003   또치
3  1004   길동
4  1005   희동
5  1006  마이콜
6  1007   영희

In [5]:
df2 = pd.DataFrame({
    '고객번호': [1001, 1001, 1005, 1006, 1008, 1001],
    '금액': [10000, 20000, 15000, 5000, 100000, 30000]
}, columns=['고객번호', '금액'])
df2

   고객번호      금액
0  1001   10000
1  1001   20000
2  1005   15000
3  1006    5000
4  1008  100000
5  1001   30000

`merge` 명령으로 위의 두 데이터프레임 df1, df2 를 합치면 공통 열인 `고객번호` 열을 기준으로 데이터를 찾아서 합친다. 이 때 기본적으로는 **양쪽 데이터프레임에 모두 키가 존재하는 데이터**만 보여주는 `inner join` 방식을 사용한다.

In [7]:
pd.merge(df1, df2)  # inner join, key 값으로 정렬까지 해준다.

   고객번호   이름     금액
0  1001   둘리  10000
1  1001   둘리  20000
2  1001   둘리  30000
3  1005   희동  15000
4  1006  마이콜   5000

`outer join` 방식은 **키 값이 한쪽에만** 있어도 데이터를 보여준다.

In [8]:
pd.merge(df1, df2, how='outer')  # outer join

   고객번호   이름        금액
0  1001   둘리   10000.0
1  1001   둘리   20000.0
2  1001   둘리   30000.0
3  1002  도우너       NaN
4  1003   또치       NaN
5  1004   길동       NaN
6  1005   희동   15000.0
7  1006  마이콜    5000.0
8  1007   영희       NaN
9  1008  NaN  100000.0

left, right 방식은 각각 첫번째, 혹은 두번째 데이터프레임의 키 값을 모두 보여준다.

In [9]:
pd.merge(df1, df2, how='left')  # df1의 키 값을 기준으로 merge

   고객번호   이름       금액
0  1001   둘리  10000.0
1  1001   둘리  20000.0
2  1001   둘리  30000.0
3  1002  도우너      NaN
4  1003   또치      NaN
5  1004   길동      NaN
6  1005   희동  15000.0
7  1006  마이콜   5000.0
8  1007   영희      NaN

In [6]:
pd.merge(df1, df2, how='right')

   고객번호   이름      금액
0  1001   둘리   10000
1  1001   둘리   20000
2  1001   둘리   30000
3  1005   희동   15000
4  1006  마이콜    5000
5  1008  NaN  100000

만약 테이블에 키 값이 같은 데이터가 여러개 있는 경우에는 있을 수 있는 모든 경우의 수를 따져서 조합을 만들어 낸다.

In [7]:
df1 = pd.DataFrame({
    '품종': ['setosa', 'setosa', 'virginica', 'virginica'],
    '꽃잎길이': [1.4, 1.3, 1.5, 1.3]},
    columns=['품종', '꽃잎길이'])
df1

          품종  꽃잎길이
0     setosa   1.4
1     setosa   1.3
2  virginica   1.5
3  virginica   1.3

In [8]:
df2 = pd.DataFrame({
    '품종': ['setosa', 'virginica', 'virginica', 'versicolor'],
    '꽃잎너비': [0.4, 0.3, 0.5, 0.3]},
    columns=['품종', '꽃잎너비'])
df2

           품종  꽃잎너비
0      setosa   0.4
1   virginica   0.3
2   virginica   0.5
3  versicolor   0.3

이 데이터에서 키 값 setosa에 대해 왼쪽 데이터프레임는 1.4와 1.3라는 2개의 데이터, 오른쪽 데이터프레임에 0.4라는 1개의 데이터가 있으므로 병합된 데이터에는 setosa가 (1.4, 0.4), (1.3, 0.4) 두 개의 데이터가 생긴다. 키 값 virginica의 경우에는 왼쪽 데이터프레임에 1.5와 1.3라는 2개의 데이터, 오른쪽 데이터프레임에 0.3와 0.5라는 2개의 데이터가 있으므로 2개와 2개의 조합에 의해 4가지 값이 생긴다.

In [9]:
pd.merge(df1, df2)

          품종  꽃잎길이  꽃잎너비
0     setosa   1.4   0.4
1     setosa   1.3   0.4
2  virginica   1.5   0.3
3  virginica   1.5   0.5
4  virginica   1.3   0.3
5  virginica   1.3   0.5

두 데이터프레임에서 이름이 같은 열은 모두 키가 된다. **만약 이름이 같아도 키가 되면 안되는 열이 있다면 `on` 인수로 기준열을 명시해야 한다.** 다음 예에서 <u>첫번째 데이터프레임의 "데이터"는 실제로는 금액을 나타내는 데이터</u>이고 <u>두번째 데이터프레임의 "데이터"는 실제로는 성별을 나타내는 데이터</u>이므로 이름이 같아도 다른 데이터이다. 따라서 이 열은 기준열이 되면 안된다.

In [10]:
df1 = pd.DataFrame({
    '고객명': ['춘향', '춘향', '몽룡'],
    '날짜': ['2018-01-01', '2018-01-02', '2018-01-01'],
    '데이터': ['20000', '30000', '100000']})  # 데이터가 금액 
df1

  고객명          날짜     데이터
0  춘향  2018-01-01   20000
1  춘향  2018-01-02   30000
2  몽룡  2018-01-01  100000

In [11]:
df2 = pd.DataFrame({  
    '고객명': ['춘향', '몽룡'],
    '데이터': ['여자', '남자']})  # 데이터가 남 여
df2

  고객명 데이터
0  춘향  여자
1  몽룡  남자

In [12]:
pd.merge(df1, df2, on='고객명')  # 고객명만 키 값으로 정해준다. 데이터는 제외

  고객명          날짜   데이터_x 데이터_y
0  춘향  2018-01-01   20000    여자
1  춘향  2018-01-02   30000    여자
2  몽룡  2018-01-01  100000    남자

이 때 기준 열이 아니면서 이름이 같은 열에는 `_x` 또는 `_y` 와 같은 접미사가 붙는다.

반대로 키가 되는 기준열의 이름이 두 데이터프레임에서 다르다면 `left_on`, `right_on` 인수를 사용하여 기준열을 명시해야 한다.

In [14]:
df1 = pd.DataFrame({
    '이름': ['영희', '철수', '철수'],
    '성적': [1, 2, 3]})
df1

   이름  성적
0  영희   1
1  철수   2
2  철수   3

In [15]:
df2 = pd.DataFrame({
    '성명': ['영희', '영희', '철수'],
    '성적2': [4, 5, 6]})
df2

   성명  성적2
0  영희    4
1  영희    5
2  철수    6

In [16]:
pd.merge(df1, df2, left_on='이름', right_on="성명")  # df1에서는 '이름'을 키로, df2에서는 '성명'을 키로, 키 값이 같음을 명시해준다.

   이름  성적  성명  성적2
0  영희   1  영희    4
1  영희   1  영희    5
2  철수   2  철수    6
3  철수   3  철수    6

일반 데이터 열이 아닌 **인덱스를 기준열로 사용**하려면 `left_index` 또는 `right_index` 인수를 `True` 로 설정한다.

In [17]:
df1 = pd.DataFrame({
    '도시': ['서울', '서울', '서울', '부산', '부산'],
    '연도': [2000, 2005, 2010, 2000, 2005],
    '인구': [9853972, 9762546, 9631482, 3655437, 3512547]})
df1

   도시    연도       인구
0  서울  2000  9853972
1  서울  2005  9762546
2  서울  2010  9631482
3  부산  2000  3655437
4  부산  2005  3512547

In [18]:
df2 = pd.DataFrame(
    np.arange(12).reshape((6, 2)),
    index=[['부산', '부산', '서울', '서울', '서울', '서울'],
           [2000, 2005, 2000, 2005, 2010, 2015]],
    columns=['데이터1', '데이터2'])
df2

         데이터1  데이터2
부산 2000     0     1
   2005     2     3
서울 2000     4     5
   2005     6     7
   2010     8     9
   2015    10    11

In [18]:
pd.merge(df1, df2, left_on=['도시', '연도'], right_index=True)

   도시    연도       인구  데이터1  데이터2
0  서울  2000  9853972     4     5
1  서울  2005  9762546     6     7
2  서울  2010  9631482     8     9
3  부산  2000  3655437     0     1
4  부산  2005  3512547     2     3

In [19]:
df1 = pd.DataFrame(
    [[1., 2.], [3., 4.], [5., 6.]],
    index=['a', 'c', 'e'],
    columns=['서울', '부산'])
df1

    서울   부산
a  1.0  2.0
c  3.0  4.0
e  5.0  6.0

In [20]:
df2 = pd.DataFrame(
    [[7., 8.], [9., 10.], [11., 12.], [13, 14]],
    index=['b', 'c', 'd', 'e'],
    columns=['대구', '광주'])
df2

     대구    광주
b   7.0   8.0
c   9.0  10.0
d  11.0  12.0
e  13.0  14.0

In [21]:
pd.merge(df1, df2, how='outer', left_index=True, right_index=True)

    서울   부산    대구    광주
a  1.0  2.0   NaN   NaN
b  NaN  NaN   7.0   8.0
c  3.0  4.0   9.0  10.0
d  NaN  NaN  11.0  12.0
e  5.0  6.0  13.0  14.0

## 2. join 메서드

`merge` 명령어 대신 `join` 메서드를 사용할 수도 있다.

In [22]:
df1.join(df2, how='outer')

    서울   부산    대구    광주
a  1.0  2.0   NaN   NaN
b  NaN  NaN   7.0   8.0
c  3.0  4.0   9.0  10.0
d  NaN  NaN  11.0  12.0
e  5.0  6.0  13.0  14.0

### **연습 문제 6-1**

두 개의 데이터프레임을 만들고 merge 명령으로 합친다. 단 데이터프레임은 다음 조건을 만족해야 한다.

1. 각각 5 x 5 이상의 크기를 가진다.  
2. 공통 열을 하나 이상 가진다. 다만 공통 열의 이름은 서로 다르다.

In [2]:
import pandas as pd
data1 = {
    '차량코드' : [1001, 1002, 1003, 1004, 1005],
    '차량명' : ['베뉴', '코나', '소나타', '아반떼', '셀토스'],
    '제조사' : ['현대차', '현대차', '현대차', '현대차', '기아차'],
    '가격' : [2000, 2800, 3200, 2300, 3000],
    '차급' : ['소형', '소형', '중형', '준중형', '소형']
}

columns1 = data1.keys()
df1 = pd.DataFrame(data1, columns=columns1)

df1

   차량코드  차량명  제조사    가격   차급
0  1001   베뉴  현대차  2000   소형
1  1002   코나  현대차  2800   소형
2  1003  소나타  현대차  3200   중형
3  1004  아반떼  현대차  2300  준중형
4  1005  셀토스  기아차  3000   소형

In [3]:
data2 = {
    '코드' : [1001, 1003, 1004, 1006, 1007],
    '중고가격' : ['정보없음', '정보없음', '정보없음', '정보없음', '정보없음'],
    '최고연비' : [13.3, 9.8, 10.6, 7.3, 8.4],
    '최저연비' : [13.7, 13.3, 17.8,  14.6, 15.0],
    '연료' : ['가솔린', '가솔린', '가솔린', '가솔린', '가솔린']
         }
columns2 = data2.keys()

df2 = pd.DataFrame(data2, columns = columns2)
df2

     코드  중고가격  최고연비  최저연비   연료
0  1001  정보없음  13.3  13.7  가솔린
1  1003  정보없음   9.8  13.3  가솔린
2  1004  정보없음  10.6  17.8  가솔린
3  1006  정보없음   7.3  14.6  가솔린
4  1007  정보없음   8.4  15.0  가솔린

In [13]:
df3 = pd.merge(df1, df2, how='left', left_on='차량코드', right_on='코드').drop('코드', axis=1)  # '코드'열 삭제 
df3

   차량코드  차량명  제조사    가격   차급  중고가격  최고연비  최저연비   연료
0  1001   베뉴  현대차  2000   소형  정보없음  13.3  13.7  가솔린
1  1002   코나  현대차  2800   소형   NaN   NaN   NaN  NaN
2  1003  소나타  현대차  3200   중형  정보없음   9.8  13.3  가솔린
3  1004  아반떼  현대차  2300  준중형  정보없음  10.6  17.8  가솔린
4  1005  셀토스  기아차  3000   소형   NaN   NaN   NaN  NaN

## 3. `concat` 명령을 사용한 데이터 연결

`concat` 명령을 사용하면 기준 열(key column)을 사용하지 않고 단순히 데이터를 연결(concatenate)한다.

기본적으로는 위/아래로 데이터 행을 연결한다. 단순히 두 시리즈나 데이터프레임을 연결하기 때문에 <u>인덱스 값이 중복될 수 있다.</u>

In [20]:
s1 = pd.Series([0, 1], index=['A', 'B'])
s2 = pd.Series([2, 3, 4], index=['A', 'B', 'C'])

In [21]:
s1

A    0
B    1
dtype: int64

In [22]:
s2

A    2
B    3
C    4
dtype: int64

In [23]:
pd.concat([s1, s2]) # 디폴트가 axis = 0, 행 방향, rbind와 유사

A    0
B    1
A    2
B    3
C    4
dtype: int64

만약 옆으로 데이터 열을 연결하고 싶으면 `axis=1`로 인수를 설정한다.

In [27]:
df1 = pd.DataFrame(
    np.arange(6).reshape(3, 2),
    index=['a', 'b', 'c'],
    columns=['데이터1', '데이터2'])
df1

   데이터1  데이터2
a     0     1
b     2     3
c     4     5

In [28]:
df2 = pd.DataFrame(
    5 + np.arange(4).reshape(2, 2),
    index=['a', 'c'],
    columns=['데이터3', '데이터4'])
df2

   데이터3  데이터4
a     5     6
c     7     8

In [30]:
pd.concat([df1, df2], axis=1, sort=True)  # axis =1, 열 방향으로 연결, cbind와 유사

   데이터1  데이터2  데이터3  데이터4
a     0     1   5.0   6.0
b     2     3   NaN   NaN
c     4     5   7.0   8.0

### **연습 문제 6-2**

어느 회사의 전반기(1월 ~ 6월) 실적을 나타내는 데이터프레임과 후반기(7월 ~ 12월) 실적을 나타내는 데이터프레임을 만든 뒤 합친다.
실적 정보는 "매출", "비용", "이익" 으로 이루어진다. (이익 = 매출 - 비용).

또한 1년간의 총 실적을 마지막 행으로 덧붙인다.

In [28]:
p_1_6 = {
    '매출' : [5000, 5500, 6600, 5000, 3000, 2500],
    '비용' : [2000, 1500, 2100, 3000, 3000, 2800],
}

p1_col = p_1_6.keys()
p1_index = ['1월', '2월', '3월', '4월', '5월', '6월']

df_p1 = pd.DataFrame(p_1_6, columns = p1_col, index = p1_index)
df_p1

      매출    비용
1월  5000  2000
2월  5500  1500
3월  6600  2100
4월  5000  3000
5월  3000  3000
6월  2500  2800

In [29]:
p_7_12 = {
    '매출' : [2000, 1500, 2000, 3000, 6000, 8000],
    '비용' : [3000, 3000, 2500, 3000, 4000, 4000]
}

p2_col = p_1_6.keys()
p2_index = ['7월', '8월', '9월', '10월', '11월', '12월']

df_p2 = pd.DataFrame(p_7_12, columns = p2_col, index = p2_index)
df_p2

       매출    비용
7월   2000  3000
8월   1500  3000
9월   2000  2500
10월  3000  3000
11월  6000  4000
12월  8000  4000

In [46]:
p_all = pd.concat([df_p1, df_p2], axis = 0)  # 열 방향 데이터 연결 
p_all

       매출    비용
1월   5000  2000
2월   5500  1500
3월   6600  2100
4월   5000  3000
5월   3000  3000
6월   2500  2800
7월   2000  3000
8월   1500  3000
9월   2000  2500
10월  3000  3000
11월  6000  4000
12월  8000  4000

In [48]:
p_all['이익'] = p_all['매출'] - p_all['비용']
p_all

       매출    비용    이익
1월   5000  2000  3000
2월   5500  1500  4000
3월   6600  2100  4500
4월   5000  3000  2000
5월   3000  3000     0
6월   2500  2800  -300
7월   2000  3000 -1000
8월   1500  3000 -1500
9월   2000  2500  -500
10월  3000  3000     0
11월  6000  4000  2000
12월  8000  4000  4000

In [53]:
p_all.loc['총 실적', :] = p_all.sum(axis=0)  # 열 방향 더하기 (디폴트)
p_all

            매출        비용       이익
1월      5000.0    2000.0   3000.0
2월      5500.0    1500.0   4000.0
3월      6600.0    2100.0   4500.0
4월      5000.0    3000.0   2000.0
5월      3000.0    3000.0      0.0
6월      2500.0    2800.0   -300.0
7월      2000.0    3000.0  -1000.0
8월      1500.0    3000.0  -1500.0
9월      2000.0    2500.0   -500.0
10월     3000.0    3000.0      0.0
11월     6000.0    4000.0   2000.0
12월     8000.0    4000.0   4000.0
총 실적  150300.0  101700.0  48600.0